InProgress/MultiElementBiWing/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass	pimpleFoam;
startFrom        	latestTime;
endTime			3;
stopAt 			endTime;
deltaT			1;
writeControl    	adjustableRunTime;
writeInterval		0.05;
cycleWrite      	0;
writeFormat     	binary;
writePrecision		6;
writeCompression 	uncompressed;
timeFormat      	general;
timePrecision   	6;
runTimeModifiable	yes;
adjustTimeStep		yes;
maxCo			2;
maxDeltaT		1;

libs
(
    "libOpenFOAM.so"
    "libforces.so"
);

functions
{
    wings
    {
        patches             (wing);
		CofR 		    (0 0 0); //Origin for moment calculations
        outputControl timeStep;
        outputInterval 5;
        type forces;
        functionObjectLibs ("libforces.so");
        pName p;
        UName U;
        rhoName rhoInf;
        rhoInf 1.18;
        log true;
    }
}

// ************************************************************************* //
